{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DATA ENGINEERING PLATFORMS (MSCA 31012)\n",
    "### File       :   PythonNeo4JDB\n",
    "#### Desc      :   Python-Neo4j for movies database\n",
    "#### Authors :   Shreenidhi Bharadwaj\n",
    "#### Date       :   11/15/2018                      \n",
    " \n",
    "Installation:\n",
    "`pip install py2neo` | \n",
    "`pip install ipython-cypher`\n",
    "\n",
    "py2neo is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j:\n",
    "\n",
    "1. Install and start Neo4J on your local machine.\n",
    "2. Make sure to run Neo4J and make sure it is running using the below URL\n",
    "    http://localhost:7474/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "from py2neo import authenticate\n",
    "from py2neo import Node\n",
    "from py2neo import Relationship\n",
    "import networkx as nx\n",
    "from py2neo import Graph as PGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "%matplotlib inline"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# set up authentication parameters\n",
    "authenticate(\"localhost:7474\", \"neo4j\", \"root\")\n",
    "\n",
    "# connect to authenticated graph database\n",
    "graph = Graph(\"http://localhost:7474/db/data/\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# delete all the data\n",
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Nodes - Create nodes with the Node class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Relationships - Create relationships between nodes with the Relationship class.\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n",
      "('name': 'Drew', 'drink': 'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "# Cypher - Retrieve Cypher query results with Graph.cypher.execute.\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "# Parameterized Cypher - Pass parameters to Cypher queries by passing additional key-value arguments to Graph.cypher.execute. Parameters in Cypher are named and are wrapped in curly braces.\n",
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n",
      "The Cython extension is already loaded. To reload it, use:\n",
      "  %reload_ext Cython\n"
     ]
    }
   ],
   "source": [
    "# ipython-cypher - ipython-cypher exposes %cypher magic in Jupyter. \n",
    "% load_ext cypher\n",
    "% load_ext Cython"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Note: %cypher is intended for single-line Cypher queries and %%cypher is intended for multi-line Cypher queries. Please do make sure that you are authenticated to use cypher."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:root@localhost:7474/db/data\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher http://neo4j:root@localhost:7474/db/data MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RangeIndex(start=0, stop=3, step=1)"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style>\n",
       "    .dataframe thead tr:only-child th {\n",
       "        text-align: right;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: left;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# NetworkX Graphs - Cypher query results can be coerced to NetworkX MultiDiGraphs, graphs that permit multiple edges between nodes, with the get_graph method. You'll first need to install NetworkX with pip install networkx."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAecAAAFCCAYAAADL3BUJAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAADl0RVh0U29mdHdhcmUAbWF0cGxvdGxpYiB2ZXJzaW9uIDIuMS4wLCBo\ndHRwOi8vbWF0cGxvdGxpYi5vcmcvpW3flQAAIABJREFUeJzt3Wl8FGW+9vGrWUPYDAKCBAEFRDAR\nIQvIIgIiIKAsYSdUA6I+HH0YJx5lcDs6wlGRI4ssAdIdIGwiOyETDcoSBRIWgxsq8DHgkU0hIoSQ\npc+LHhyZsCSkSVV3/75v/KSrU33lxczF/+6qu2wul8slAABgGWXMDgAAAC5HOQMAYDGUMwAAFkM5\nAwBgMZQzAAAWQzkDAGAxlDMAABZDOQMAYDGUMwAAFkM5AwBgMZQzAAAWQzkDAGAxlDMAABZDOQMA\nYDGUMwAAFkM5AwBgMZQzAAAWQzkDAGAxlDMAABZDOQMAYDGUMwAAFkM5AwBgMZQzAAAWQzkDAGAx\nlDMAABZTzuwAgCTpxAnJ6ZQyMqSsLKl6dSk0VLLbpVq1zE4HAKXK5nK5XGaHgB9LS5MmT5Y2bXL/\nfOHCv45VqiS5XFKPHtKECVJ4uDkZAaCUUc4wz+zZUkyMlJ3tLuGrsdncRT1livT006WXDwBMwrI2\nzHGpmM+fv/57XS73+2Ji3D9T0AB8HJMzSl9amtSpU9GK+d8FBkpbtkhhYR6PBQBWwdXaKH2TJ7uX\nsm9Edrb79wHAhzE5o3SdOCE1aHD5hV/FFRAgZWZyFTcAn8XkjNLldJb8HDabZ84DABZFOaN0ZWSU\nbGqW3Evb+/d7Jg8AWBDljNKVleWZ85w+7ZnzAIAFUc4oXdWre+Q027/6Sps3b1ZBQYFHzgcAVkI5\no3SFhrov6CqB85LWHD6sLl266M4779Srr76qQ4cOeSYfAFgAV2ujdHngau1sSXdIOvVvr3fs2FF2\nu10DBgxQlSpVSpISAExFOaP09esnrVlz7S07ryJf0hpJA67xnsqVKysqKkqGYahDhw4qU4YFIgDe\nhXJG6SvBDmHnJD0oaXcR33/nnXdq5MiRio6OVsOGDYv9eQBgBsoZ5ijO3tr/lF2mjP5SUKC5//Z6\nuXLllJeXd93f79y5swzDUP/+/RUYGFjMwABQeljvgzmeftr9lKnAQPemItdis0mBgao4fboav/OO\nKlaseNnhS8V89913q06dOlc9zebNmxUdHa06depozJgxSk1NFf82BWBFTM4wV3q6e6/sxER3Cf95\nz+1Lz3Pu2dP9POd/Puzim2++kd1u186dOwudrmbNmho7dqwOHTqk1atXKycn55of37hxYxmGoejo\naNWvX9+jfxoA3CjKGdZw8qR7S879+90bjAQFSSEhkmFccQ/tvLw8TZ06VS+//LIuXrxY6HhUVJTe\nfPNNpaSkyOl0XrHI/8xms6lr166y2+16/PHHValSJQ/9YQBQfJQzvNrXX38twzCUlpZW6FitWrU0\na9YsDRgwQF9//bXi4+O1cOFCHTt27JrnrF69ugYPHizDMBQZGSnb9ZbdAcDDKGd4vby8PL3zzjt6\n9dVXlZubW+j4oEGDNHPmTNWsWVN5eXlKTk6Ww+HQunXrrjh1/1mzZs1kGIZGjBih22+//Wb9CQBw\nGcoZPuPLL7+UYRjavbvwjVa1a9fWnDlz1Ldv3z9e++WXX7Rs2TI5HI4r/s6flSlTRo888ogMw1Cf\nPn0UUMJdzgDgWihn+JTc3Fy9/fbb+q//+q8rTtFDhgzRjBkzdOutt172+v79++V0OrV48WKdOHHi\nmp8RFBSkIUOGyDAMhYWFsewNwOMoZ/ikjIwMGYahvXv3Fjp22223ae7cuXrssccKHcvNzdWmTZvk\ndDq1fv36694/3aJFCxmGoeHDh1/zNi4AKA7KGT4rNzdXkydP1htvvHHFkh02bJimT5+uGjVqXPH3\nT548qSVLlsjpdGrfvn3X/KyyZcuqR48estvt6tWrlypUqOCRvwGAf6Kc4fO++OILGYZxxYKtU6eO\nYmNj1bt372ueY9++fXI6nUpISNCpU//+yI3L3XrrrRo6dKjsdrvuv//+EmUH4J8oZ/iFixcvatKk\nSXrzzTevOEWPGDFC06ZNU1BQ0HXPs3HjRjmdTm3cuFH5+fnXfP99990nwzA0bNgw1brC/doAcCWU\nM/zK3r17ZRiGMjIyLnu9fPny2rNnj+69994in+v48eNKSEiQw+HQl19+ec33litXTr169ZJhGOrZ\ns6fKly9/Q/kB+AfKGX7n4sWL+vvf/65Jkyb9MfnWrVtXSUlJCg0NLfb5XC6X9uzZI4fDoSVLluj0\n6dPXfH+tWrU0fPhwGYZxQ58HwPdRzvBbu3fvlmEYCggI0NixY/W3v/1Nzz77rF588cUbnmxzcnK0\nfv16ORwOJSUlqaCg4Jrvb9WqlQzD0NChQwvd3gXAf1HO8Gs5OTk6deqU6tWrpyNHjuiJJ57QyZMn\nFR8fX6wl7iv5+eeftWjRIjkcDn377bfXfG/58uXVp08fGYah7t27q1y5ciX6bADejXIG/sTlcmnB\nggWaMGGCxo8frxdeeKHERelyubRr1y45nU4tXbpUWVlZ13z/bbfdphEjRshut6t58+Yl+mwA3oly\nBq4gMzNTY8aM0enTp+V0OtWiRQuPnDc7O1tr166V0+lUcnLydZ8nHR4eLrvdrqeeeoqdyAA/QjkD\nV+FyuTRv3jxNnDhRf/3rXxUTE+PR5eajR4/+sez9/fffX/V9HTp00NatWz32uQCsj3IGruPHH3/U\n6NGjdfbsWTmdTt1zzz0ePb/L5dLnn38up9OpZcuW6ezZs5cdr1+/vmJiYjR06FDVrFnTo58NwJrK\nmB0AsLoGDRroo48+kt1uV8eOHfX2229fd/OR4rDZbHrggQcUGxurY8eOafHixerSpYtsNpsCAwP1\n/vvvKy0tTY0bN1b//v21fv36Kz7UA4DvYHIGiuHw4cMaPXq0srOz5XA41KxZs5v2WT/++KP27dv3\nxwM6srKy9MEHH8jhcOjgwYN/3Ctd0qvKAVgP5QwUU0FBgebMmaNXXnnlj6u6y5YtW6oZvvvuO8XH\nxys+Pl516tSR3W7XkCFDrvoQDwDehXIGbtChQ4c0atQo5ebmyuFwqGnTpqWeIT8/XykpKXI6nUpM\nTFS3bt1kGIa6devGvdKAF6OcgRIoKCjQrFmz9Nprr2nixIl69tlnS32KvuTMmTNavny5HA6HMjMz\nNWLECBmG4fEL2ADcfJQz4AEHDx6U3W5XQUGBHA6HmjRpYmqeb775Rk6nU4sWLdIdd9whu92uQYMG\n6ZZbbjE1F4Ci4WptwAPuuusuffrpp4qKilLbtm01bdq06+6rfTPdc889euutt5SZmalXXnlFKSkp\natiwoYYMGaLk5GSPXm0OwPOYnAEP+/7772W321WmTBnFxcWpcePGZkeSJP3yyy9atmyZnE6njh07\npujoaI0cOdKU78oBXBuTM+BhTZo00ZYtW9S3b1+1adNGM2bMMHWKvuTWW2/VuHHjlJaWpsTEROXk\n5Khjx45q37695s+fr99++83siAD+ickZuIkOHDggu92uChUqKC4uTnfeeafZkS6Tm5urpKQkORwO\nbd68Wb1795ZhGHrooYdUpgz/dgfMwv/6gJvo7rvv1rZt29S7d29FRETo/ffft8QUfUn58uXVu3dv\nrVq1St9//73Cw8MVExOjRo0a6ZVXXtHBgwfNjgj4JSZnoJR8++23MgxDgYGBiouLU8OGDc2OdFX7\n9u2T0+nUkiVLdM8998gwDEVFRalKlSpmRwP8ApMzUEqaNWum1NRUde/eXeHh4Zo9e7alpug/a9my\npd577z0dPXpU48eP15o1axQcHCzDMLRlyxbL5gZ8BZMzYIJvvvlGhmGoatWqWrBggRo0aGB2pOs6\nfvy4EhIS5HA4dO7cORmGoejoaEuvAADeiskZMME999yj1NRUde3aVWFhYYqNjZXV/51822236bnn\nnlNGRoY++OADnTx5UmFhYercubMWLVqkc+fOmR0R8BlMzoDJvvrqKxmGoaCgIM2fP1933HGH2ZGK\nLCcnR+vXr5fD4dBnn32m/v37yzAMtWvXTjabzex4gNdicgZM1qJFC33++efq1KmTWrdurfnz51t+\nir6kYsWKGjBggDZu3Kivv/5aTZs21dixY9W0aVO9+eabOnLkiNkRAa/E5AxYyP79+2UYhmrVqqX5\n8+crODjY7EjF5nK5lJaWJofDoRUrVqh169YyDEN9+/ZVpUqVzI4HeAUmZ8BCQkJCtGPHDrVv316t\nWrWSw+Hwmin6EpvNpoiICM2ePVs//fSTRo0apYULF6pevXp68skntWPHDq/7m4DSxuQMWFRGRoZG\njhyp22+/XbGxsapXr57ZkUrk6NGjWrRokZxOp2w22x9Xe99+++1mRwMsh8kZsKjQ0FDt2rVLkZGR\nuv/++xUfH+/VE2dwcLAmTJigb7/9VnFxcTp06JDuvfde9ejRQytWrNCFCxfMjghYBpMz4AX27dsn\nwzAUHBys2NhYn5k2z58/r9WrV8vhcGjfvn0aNGiQDMNQWFgYV3vDrzE5A16gZcuW2rVrl8LCwtSy\nZUstWrTIq6foSwIDAzVs2DB9/PHH2r17t+rUqaPBgwcrJCREU6ZM0bFjx8yOCJiCyRnwMnv27JFh\nGGrYsKHmzp2runXrmh3Jo1wul7Zv3y6Hw6HVq1erffv2MgxDvXv3VoUKFcyOB5QKJmfAy7Rq1Urp\n6em677771LJlSyUkJPjEFH2JzWZThw4dFBcXpyNHjmjAgAGaOXOm6tWrp2effVZ79+71qb8XuBIm\nZ8CL7d69WyNHjlSTJk00e/Zs1alTx+xIN83hw4cVHx8vp9Op6tWry263a+jQoapdu7bZ0QCPY3IG\nvFjr1q21e/duNW/eXPfdd5+WLl3qs1Nlo0aN9Nprr+nQoUN67733tHfvXjVt2lSPP/641q5dq9zc\nXLMjAh7D5Az4iLS0NBmGoWbNmmn27Nl+MVGePXtWH3zwgRwOh7777jsNHTpUdrtdoaGhZkcDSoTJ\nGfAR4eHh2r17t5o2barQ0FCtWLHC7Eg3XdWqVTVq1Cht27ZNqampqlKlinr16qXWrVtrxowZOnXq\nlNkRgRvC5Az4oJ07d8owDN17772aNWuWatWqZXakUpOfn69PPvlEDodDGzduVNeuXWUYhrp3765y\n5cqZHQ8oEiZnwAdFRkZq7969atSokUJDQ7Vy5UqzI5WasmXLqmvXrkpISNCPP/6obt26adKkSapf\nv76ef/55ffXVV2ZHBK6LyRnwcTt27JBhGGrZsqVmzpypmjVrmh3JFAcOHJDT6fzjIRyGYWjIkCEK\nCgoyOxpQCJMz4OPatGmjvXv3Kjg4WKGhoVq1apXZkUxx9913a/LkycrMzNTrr7+urVu3qlGjRho0\naJCSkpKUn59vdkTgD0zOgB9JTU2V3W5XWFiYZsyYoVtvvdXsSKY6ffq0li1bJqfTqaNHjyo6Oloj\nR45Us2bNzI4GP8fkDPiRdu3aad++fapTp45CQkK0du1asyOZKigoSE8//bR27typ5ORk5eXl6aGH\nHlLbtm0VGxurrKwssyPCTzE5A35q+/btstvtioyM1PTp01WjRg2zI1lCXl6e/vGPf8jhcOjjjz/W\no48+KsMw1LlzZ5UtW9bsePATTM6An2rfvr2++OIL1axZUyEhIVq3bp3ZkSyhXLlyevTRR7Vy5Uod\nPHhQbdq00YsvvqhGjRrppZde0vfff292RPgBJmcA2rp1q0aNGqUHHnhA06ZN4wrmK8jIyJDT6VRC\nQoKaNm0qwzA0cOBAVa1a1exo8EFMzgDUsWNHffHFF7rlllsUEhKijRs3mh3JckJDQzV16lQdPXpU\nMTEx2rBhg+rXr6/o6Gh98sknKigoMDsifAiTM4DLfPrppxo1apQ6duyo9957T7fccovZkSzrxIkT\nWrJkiRwOh7KysjRy5EgZhqFGjRqZHQ1ejskZwGU6deqkjIwMValSRSEhIdq0aZPZkSyrdu3aGj9+\nvPbt26fVq1frzJkzioiIUKdOnRQfH6/ff//d7IjwUkzOAK5q8+bNGj16tDp37qypU6eqevXqZkey\nvJycHG3cuFEOh0Pbt29X3759ZRiGOnToIJvNZnY8eAkmZwBX1blzZ2VkZKhChQoKCQnRP/7xD7Mj\nWV7FihXVr18/rV+/Xt98842aN2+up59+Wo0bN9Ybb7yhH3/80eyI8AJMzgCK5OOPP9aYMWP08MMP\n691331W1atXMjuQ1XC6X0tPT5XQ6tWzZMt1///0yDEP9+vVTYGCg2fFgQZQzgCL77bff9Pzzzysp\nKUnz58/Xww8/fO1fOHFCcjqljAwpK0uqXl0KDZXsdsmPHmP5ZxcuXNC6devkdDq1Y8cO9e/fX3a7\nXW3btmXZG3+gnAEUW3Jysp544gl1795dU6ZMKXyvb1qaNHmydOlisgsX/nWsUiXJ5ZJ69JAmTJDC\nw0svuMX89NNPWrx4sRwOhwoKCmQYhqKjoxUcHGx2NJiM75wBFFu3bt2UkZGhgoIChYSEKCUl5V8H\nZ8+WOnWS1qxxl/Kfi1mSsrPdr61Z437f7NmlGd1S6tWrpxdeeEHffPONFi5cqMzMTIWGhuqRRx7R\nsmXLlJ2dbXZEmITJGUCJJCUlaezYserVq5emNm2qgIkTpfPni36CwEBpyhTp6advXkgvkp2drTVr\n1sjhcGj37t2KioqS3W5XREQEy95+hHIGUGJZWVmaPmKE/rphgwJv5P9SAgOlLVuksDDPh/NiR44c\n0cKFC+V0OlW+fHkZhqHhw4fr9ttvNzsabjKWtQGUWPXq1fVyuXIKuNETZGe7v6PGZerXr6+JEyfq\nu+++U2xsrL777ju1aNFCjz76qD744APl5OSYHRE3CZMzgJI7cUJq0KDw98vFERAgZWb67VXcRXXu\n3DmtWrVKTqdTX3zxhQYPHizDMNS6dWuWvX0IkzOAknM6S34Om80z5/FxlStX1ogRI5SSkqL09HTV\nrl1bAwcOVGhoqN59910dP37c7IjwAMoZQMllZJRsapbcS9v793smj59o2LChXnnlFf3www+aOXOm\nvvzyS919993q06ePVq9erYsXL5odETeIcgZQcllZnjnP6dOeOY+fKVOmjB588EE5HA4dPXpU/fr1\n03vvvafg4OA/HswB70I5Ayg5Tz0QIyjIM+fxY1WqVJFhGNqyZYs+//xzVatWTY899phatmypadOm\n6eTJk2ZHRBFQzgBKLjTUfUFXSVSqJIWEeCYPJEl33XWXXn/9dR0+fFhTp05Venq6mjRpon79+mnd\nunXKzc01OyKugqu1AZQcV2t7jd9++00rVqyQ0+nUDz/8oGHDhskwDIXwDyNLYXIGUHK1a0s9esh1\no7fy2GxSz54UcymoVq2axowZo+3bt2vr1q0KCAhQz549FRYWppkzZ+rXX381OyLE5AzAQ04mJqpK\n796qVFBQ/F9mhzBT5efnKyUlRU6nU4mJiXr44Ydlt9vVrVs3lStXzux4folyBlBi27Zt0+DBgzWv\nVSv12LxZNvbW9lpnzpzR8uXL5XA4lJmZqeHDh8tut+uee+4xO5pfYVkbwA1zuVyaMWOGBgwYoPnz\n56vn+vWyTZniLtzrLXHbbBSzBd1yyy168skntWPHDqWkpMhms6lLly6KjIzUnDlzdJrb3UoFkzOA\nG3L+/HmNHTtWX375pVatWqU777zzXwfT0917ZScmukv4z48+vPQ855493c9zZinb8vLy8vTRRx/J\n4XAoOTlZPXr0kGEY6tq1q8qWLWt2PJ9EOQMotkOHDqlfv34KCQnR3LlzFRgYeOU3njzp3pJz/373\nBiNBQe7bpQyDi7+81K+//qqlS5fK6XTq559/VnR0tAzDUNOmTc2O5lMoZwDFsmnTJhmGoZdfflnj\nxo3jYQt+bP/+/YqPj9fixYt11113yTAMDRw4UNU9tSmNH6OcARRJQUGB3nzzTc2ZM0fLly9X+/bt\nzY4Ei8jNzVVSUpKcTqdSUlLUq1cv2e12PfTQQypThkubbgTlDOC6zpw5o+joaP3666/64IMPVLdu\nXbMjwaJOnTqlJUuWyOFw6Ndff/1j2fuuu+4yO5pX4Z80AK7pyy+/VHh4uBo0aKDNmzdTzLimmjVr\n6tlnn9XevXu1du1anT17Vm3btlXHjh3lcDh09uxZsyN6BSZnAFe1fPly/cd//IemTp2qESNGmB0H\nXurixYtKTEyUw+HQli1b9Nhjj8lut6tjx44se18F5QygkLy8PL3wwgtavXq1PvzwQ91///1mR4KP\nOH78uBISEuRwOHTu3DmNHDlS0dHRatSoUclPfuKE++6AjAz3Y0yrV3c/lMVu97q7AyhnAJc5ceKE\nBg0apIoVK2rJkiWqUaOG2ZHgg1wul/bs2SOn06mlS5cqNDRUhmGof//+qly5cvFOlpbmvq9+0yb3\nz39+AMul++p79HDfVx8e7rk/4iainAH8YefOnYqKitLIkSP12muvscEESkVOTo7Wr18vp9Op1NRU\n9evXT4ZhqH379te/VW/2bCkmxr3RzbXqzGZzF7WX7EhHOQOQy+XSvHnz9NJLL2nevHl67LHHzI4E\nP/Xzzz9r8eLFcjgcunjxogzDUHR0tO64447Cb75UzD64lzvlDPi5CxcuaNy4cdqxY4dWr17NTk+w\nBJfLpbS0NDkcDq1YsUKtWrWS3W7X448/7t6RLi1N6tSpeMV8iRc8BY1yBvxYZmam+vfvr0aNGiku\nLk5VqlQxOxJQyIULF7R27Vo5HA7t2rVLAwYM0OQDB1Rj2zbZbqTCbDapb1/pww89H9ZDuIYd8FMp\nKSmKiIjQ4MGDtXz5cooZlhUQEKBBgwYpKSlJGRkZalGrlqrcaDFL7u+mExPde79bFOUM+BmXy6W3\n335bw4cP15IlS/TXv/6V/bHhNYKDg/X/q1dXhYoVS3Yim81925VFlTM7AIDSc/bsWdntdmVmZmrX\nrl2qX7++2ZGA4svIkO3Pt0vdiOxs99PSLIrJGfAT3377rSIjI1WjRg1t3bqVYob3ysryzHlOn/bM\neW4CyhnwA6tXr1bHjh313HPPKTY2VgEBAWZHAm6cpx5JGRTkmfPcBCxrAz4sPz9fL7/8shISErRh\nwwZFRESYHQkoudBQ95XWJVnarlRJCgnxXCYP41YqwEf98ssvGjJkiPLy8rRs2TLVrl3b7EiAZ5w4\nITVoULJyDgiQMjMtu+c2y9qAD9qzZ4/CwsLUsmVLJScnU8zwLbVru/fKvtG7DGw2qWdPyxazxOQM\n+Jz4+HjFxMRo1qxZioqKMjsOcHP4+A5hfOcM+IiLFy9q/PjxSklJ0aeffqoWLVqYHQm4ecLD3Xtk\n3+je2hYuZolyBnzCTz/9pKioKNWuXVu7du1SdU9dzQpY2aWHV/jgU6n4zhnwclu3blVERIQeffRR\nrVq1imKGf3n6afcSdd++7ou8KlW6/HilSu7X+/Z1v88LilniO2fAa7lcLk2fPl2TJk3SwoUL9cgj\nj5gdCTDXyZPuLTn373dvMBIU5L5dyjAsffHXlVDOgBc6d+6cxo4dq6+//lqrVq1So0aNzI4EwINY\n1ga8zMGDB9W2bVuVLVtWqampFDPggyhnwIskJibqgQce0JNPPqn4+Hj3Q+cB+Byu1ga8QEFBgd54\n4w3NmzdPq1atUrt27cyOBOAmopwBiztz5oxGjBihM2fOKC0tTXXr1jU7EoCbjGVtwML279+v8PBw\n3Xnnndq8eTPFDPgJyhmwqKVLl6pz58569dVXNW3aNJUvX97sSABKCcvagMXk5ubqhRde0Nq1a/Xx\nxx/rvvvuMzsSgFJGOQMWcvz4cQ0cOFCBgYFKS0tTjRo1zI4EwAQsawMWsWPHDoWFhenBBx/Uhg0b\nKGbAjzE5AyZzuVyaO3euXnnlFS1YsEC9e/c2OxIAk1HOgImys7M1btw47dq1S6mpqWrSpInZkQBY\nAMvagEl+/PFHtW/fXufPn9eOHTsoZgB/oJwBE3z00UeKjIzUsGHDtHTpUlWpUsXsSAAshGVtoBS5\nXC699dZbmjZtmpYtW6ZOnTqZHQmABVHOQCn57bffZLfbdfToUaWlpSk4ONjsSAAsimVtoBR8++23\nioyMVK1atbR161aKGcA1Uc7ATbZq1Sp16NBBMTExmjNnjipWrGh2JAAWx7I2cJPk5+frpZde0pIl\nS7Rp0yaFhYWZHQmAl6CcgZvg1KlTGjJkiFwul9LT01WrVi2zIwHwIixrAx62e/duhYWFqVWrVkpK\nSqKYARQbkzPgQQ6HQ//5n/+p2bNna8CAAWbHAeClKGfAA3JycjR+/Hht3rxZW7ZsUfPmzc2OBMCL\nUc5ACf30008aMGCA6tSpo7S0NFWrVs3sSAC8HN85AyWwZcsWhYeHq0+fPvrwww8pZgAeweQM3ACX\ny6X33ntPb731lhYuXKhu3bqZHQmAD6GcgWI6d+6cxowZowMHDmjHjh1q2LCh2ZEA+BiWtYFi+OGH\nH9SmTRsFBAQoNTWVYgZwU1DOQBFt2LBBDzzwgMaNG6e4uDhVqlTJ7EgAfBTL2sB1FBQU6PXXX9eC\nBQu0du1atW3b1uxIAHwc5Qxcw+nTpzV8+HD9/vvvSktLU506dcyOBMAPsKwNXEVGRobCw8PVtGlT\nffzxxxQzgFJDOQNXkJCQoC5duuiNN97Q//zP/6h8+fJmRwLgR1jWBv4kNzdXMTEx2rhxo1JSUhQa\nGmp2JAB+iHIG/unYsWMaOHCgqlatqrS0NAUFBZkdCYCfYlkbkPTZZ58pLCxMXbp00fr16ylmAKZi\ncoZfc7lcmj17tl577TXFxcWpV69eZkcCAMoZ/is7O1tPPfWU9u7dq88++0yNGzc2OxIASGJZG37q\n8OHDateunXJzc/X5559TzAAshXKG30lOTlabNm0UHR2thIQEVa5c2exIAHAZlrXhNwoKCvTf//3f\nmjlzplasWKEHH3zQ7EgAcEWUM/zCb7/9ppEjR+rYsWNKS0tTvXr1zI4EAFfFsjZ83tdff63w8HDV\nrVtXn376KcUMwPIoZ/i0lSvInFkuAAALE0lEQVRX6sEHH9SECRM0a9YsVaxY0exIAHBdLGvDJ+Xl\n5elvf/ubVqxYoaSkJLVu3drsSABQZJQzfM7Jkyc1ePBglSlTRunp6apZs6bZkQCgWFjWhk9JS0tT\nWFiYIiMjlZSURDED8EpMzvAZCxYs0Isvvqi5c+eqX79+ZscBgBtGOcPr5eTk6Nlnn9XWrVu1bds2\nNWvWzOxIAFAiLGvDqx05ckQdO3bUqVOntGvXLooZgE+gnOG1PvnkE0VERKhfv35auXKlqlatanYk\nAPAIlrXhdVwul6ZOnap33nlHixcvVteuXc2OBAAeRTnDq/z+++8aPXq0Dh48qJ07d6pBgwZmRwIA\nj2NZG17ju+++U5s2bVS5cmVt376dYgbgsyhneIV169apffv2euaZZ7RgwQIFBASYHQkAbhqWtWFp\n+fn5eu211+R0OrVu3Tq1adPG7EgAcNNRzrCsX3/9VcOGDVN2drbS09N12223mR0JAEoFy9qwpH37\n9ik8PFzNmzfXRx99RDED8CtMzrCcxYsX6y9/+YtmzJihwYMHmx0HAEod5QzLuHjxomJiYrRp0yZt\n3rxZISEhZkcCAFNQzrCEn3/+WVFRUQoKClJaWppuueUWsyMBgGn4zhmmS01NVXh4uLp166a1a9dS\nzAD8HpMzTONyufT+++/rjTfekMPhUM+ePc2OBACWQDnDFOfPn9dTTz2lL774Qp999pnuuususyMB\ngGWwrI1Sd+jQIT3wwAPKz8/X559/TjEDwL+hnFGqkpKS1LZtW40aNUqLFy9WYGCg2ZEAwHJY1kap\nKCgo0KRJkzR79mytXLlSHTp0MDsSAFgW5YybLisrS9HR0Tp58qTS0tJ0++23mx0JACyNZW3cVF99\n9ZXCw8MVHBysTz/9lGIGgCKgnHHTrFixQp06ddLEiRP1/vvvq0KFCmZHAgCvwLI2PC4vL08TJkzQ\nypUrlZycrPvvv9/sSADgVShneNSJEyc0ePBglS9fXunp6br11lvNjgQAXodlbXjMrl27FBYWprZt\n2yoxMZFiBoAbxOQMj5g3b54mTpyo2NhYPf7442bHAQCvRjmjRC5cuKBnnnlGqamp2rZtm+6++26z\nIwGA12NZGzfsyJEj6tixo86cOaOdO3dSzADgIZQzbsjmzZsVERGhqKgorVixQlWrVjU7EgD4DJa1\nUSwul0vvvvuu3n33XS1evFhdunQxOxIA+BzKGUV29uxZjR49WocPH9bOnTt1xx13mB0JAHwSy9oo\nkgMHDqhNmzaqVq2atm3bRjEDwE1EOeO61qxZow4dOmj8+PGaP3++AgICzI4EAD6NZW1cVX5+vl59\n9VUtXLhQ69evV2RkpNmRAMAvUM64ol9++UXDhg1TTk6O0tPTVbt2bbMjAYDfYFkbkqSCggL98MMP\nkqS9e/cqPDxc9957rz766COKGQBKGeUMZWVlqW/fvoqIiNC7776rbt26afLkyZoyZYrKlWNxBQBK\nm83lcrnMDgHzfPXVV+rbt6++//57SVLFihW1bds2hYeHm5wMAPwXk7MfW7FihSIjI/8oZknKycnR\nwoULTUwFAKCc/VBeXp6ef/55DRo0SOfOnbvsWHh4uJ5//nmTkgEAJK7W9jsnTpzQ4MGD9cknnxQ6\nNmbMGM2YMYP7mAHAZJSzH9m1a5f69++vo0ePXvZ6hQoVNHPmTD3xxBMmJQMA/BnL2n5i3rx56tCh\nQ6FiDg4O1rZt2yhmALAQytnHXbhwQWPGjNHYsWN18eLFy4499NBD2r17tyIiIkxKBwC4EsrZh2Vm\nZqpDhw5asGBBoWMxMTFKTk5mgxEAsCC+c/ZRKSkpGjx4sE6dOnXZ65UrV1ZcXJwGDhxoUjIAwPUw\nOfsYl8uld955R926dStUzE2aNNHOnTspZgCwOCZnH3L27FmNGjVKK1euLHSsT58+WrhwoapXr25C\nMgBAcTA5+4gDBw4oMjKyUDHbbDb9/e9/1+rVqylmAPASTM4+YM2aNYqOjtbZs2cvez0oKEhLlixR\n9+7dTUoGALgRTM5eLD8/XxMnTlTfvn0LFXPLli2Vnp5OMQOAF2Jy9lK//PKLhg4dquTk5ELHRowY\noTlz5igwMNCEZACAkmJy9kJ79uxRWFhYoWIuV66cZsyYofj4eIoZALwYk7OXiY+P11NPPaULFy5c\n9nqdOnW0cuVKtWvXzqRkAABPYXL2EhcvXtS4ceNkGEahYm7Xrp327NlDMQOAj6CcvcD//u//qlOn\nTpo1a1ahY88884w2b96sunXrmpAMAHAzsKxtcdu2bVNUVJSOHz9+2euVKlVSbGyshg8fblIyAMDN\nwuRsUS6XS9OnT1fnzp0LFXOjRo302WefUcwA4KOYnC3o/PnzeuKJJ7RkyZJCx7p3766EhATVqFHD\nhGQAgNLA5GwxBw8eVNu2ba9YzC+//LI2bNhAMQOAj2NytpDExEQNGzZMZ86cuez1atWqadGiRerT\np49JyQAApYnJ2QIKCgr0+uuvq1evXoWKuXnz5kpLS6OYAcCPMDmb7MyZMxoxYoQ2bNhQ6FhUVJTi\n4uJUpUoVE5IBAMzC5Gyi/fv3Kzw8vFAxlylTRlOmTNHy5cspZgDwQ0zOJlm2bJlGjx6t8+fPX/Z6\nzZo1tXz5cnXu3NmkZAAAszE5l7Lc3Fw999xzGjJkSKFiDg8P1549eyhmAPBzTM6l6Pjx4xo0aJC2\nbNlS6NgTTzyh6dOnKyAgwIRkAAAroZxLyY4dOzRgwAD99NNPl71eoUIFvf/++xozZoxJyQAAVkM5\nl8SJE5LTKWVkSFlZUvXqUmioZLdLtWpJcm/DGRsbq2eeeUa5ubmX/XpwcLA+/PBDRUREmBAeAGBV\nNpfL5TI7hNdJS5MmT5Y2bXL//OdHOFaqJLlcUo8eynnuOf0/h0NxcXGFTvHQQw9p2bJlql27dimF\nBgB4C8q5uGbPlmJipOxsdwlfhctm0wWbTX8pKNDcfzv2/PPPa9KkSSpXjoULAEBhtENxXCrmf7vK\n+kpsLpcquVx6958/z5VUuXJlORwORUVF3dSYAADvxuRcVGlpUqdORSrmf3dOUvQdd+j1xES1aNHC\n49EAAL6FybmoJk92L2XfgEqSlt53nypQzACAImByLooTJ6QGDS6/8Ku4AgKkzMw/ruIGAOBq2CGs\nKJzOkp/DZvPMeQAAPo9yLoqMjJJNzZJ7SXz/fs/kAQD4NMq5KLKyPHOe06c9cx4AgE+jnIuienXP\nnCcoyDPnAQD4NMq5KEJD3Rd0lUSlSlJIiGfyAAB8GldrFwVXawMAShGTc1HUri316OG+4vpG2GxS\nz54UMwCgSJici6oEO4QpMFDaskUKC/N4LACA72FyLqrwcGnKFHfRFkdgoPv3KGYAQBGxfWdxPP20\n+79FeCqVbDb3RWBTpvzr9wAAKAKWtW9Eerp7r+3ERHcJ/3nP7UvPc+7ZU5owgYkZAFBslHNJnDzp\n3pJz/373BiNBQe7bpQyDi78AADeMcgYAwGK4IAwAAIuhnAEAsBjKGQAAi6GcAQCwGMoZAACLoZwB\nALAYyhkAAIuhnAEAsBjKGQAAi6GcAQCwGMoZAACLoZwBALAYyhkAAIuhnAEAsBjKGQAAi6GcAQCw\nGMoZAACLoZwBALAYyhkAAIuhnAEAsBjKGQAAi6GcAQCwGMoZAACLoZwBALAYyhkAAIuhnAEAsBjK\nGQAAi6GcAQCwGMoZAACLoZwBALAYyhkAAIuhnAEAsBjKGQAAi6GcAQCwGMoZAACLoZwBALAYyhkA\nAIuhnAEAsJj/A0XujaG7rslYAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x2887b2f8048>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "# NetworkX Graphs - Cypher query results can be coerced to NetworkX MultiDiGraphs, graphs that permit multiple edges between nodes, with the get_graph method. You'll first need to install NetworkX with pip install networkx.\n",
    "\n",
    "results = %cypher http://neo4j:root@localhost:7474/db/data MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "NodeDataView({'396': {'name': 'Mountain Dew', 'calories': 9000, 'labels': ['Drink']}, '399': {'name': 'Drew', 'age': 20, 'labels': ['Person']}, '395': {'name': 'Nicole', 'age': 24, 'labels': ['Person']}, '400': {'name': 'Coke Zero', 'calories': 0, 'labels': ['Drink']}})"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "DiMultiDegreeView({'396': 2, '399': 1, '395': 2, '400': 1})"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# igraph - Cypher query results can be imported into igraph with py2neo. You'll need to install igraph with pip install python-igraph. Query results should be returned as edgelists, as igraph has a method for building an igraph object from a list of tuples representing edges between nodes.\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-a2cace02-5f18-4690-8a10-7899abf5913a\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-a2cace02-5f18-4690-8a10-7899abf5913a');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 395, \"target\": 396 },\n",
       "        { \"source\": 395, \"target\": 400 },\n",
       "        { \"source\": 397, \"target\": 396 },\n",
       "        { \"source\": 398, \"target\": 400 },\n",
       "        { \"source\": 399, \"target\": 396 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"395\": { \"location\": [ -1.4717965422023302, -1.4033686193971662, -1.9781207301314316 ] },\n",
       "        \"396\": { \"location\": [ -0.6258445775484168, -0.9206581408661929, -0.25865064499250906 ] },\n",
       "        \"397\": { \"location\": [ 0.7263322486484849, 0.7422778409717072, 0.2820310415446936 ] },\n",
       "        \"398\": { \"location\": [ 1.6319775481789407, 1.6024757229927626, 1.7367371543787318 ] },\n",
       "        \"399\": { \"location\": [ 2.0, 2.0, 2.0 ] },\n",
       "        \"400\": { \"location\": [ -2.0, -2.0, -2.0 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# References: \n",
    "# http://nicolewhite.github.io/"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 1
}
